----------------------------------------------------------------------------------
      name:  <unnamed>
       log:  Z:\home\pacha\github\advanced-international-trade\first-edition\Chapt
> er-8\car_reg.log
  log type:  text
 opened on:  19 Jun 2024, 21:41:03

. 
. use Z:\home\pacha\github\advanced-international-trade\first-edition\Chapter-8\ca
> r_7990,clear

. drop if year>=86
(105 observations deleted)

. 
. tab year, gen(yd)

       year |      Freq.     Percent        Cum.
------------+-----------------------------------
         79 |         21       11.73       11.73
         80 |         24       13.41       25.14
         81 |         24       13.41       38.55
         82 |         24       13.41       51.96
         83 |         26       14.53       66.48
         84 |         29       16.20       82.68
         85 |         31       17.32      100.00
------------+-----------------------------------
      Total |        179      100.00

. 
. program define nlcar
  1. version 7.0
  2. if "`1'"=="?"{
  3. global S_1 "a3 a4 a5 a6 a7 b2 b3 b4 b5 b6 b7 c1 c2 c3 c4 c5 c6 c7 c8"
  4. global a3=1
  5. global a4=1
  6. global a5=1
  7. global a6=1
  8. global a7=1
  9. global b2=.1
 10. global b3=.1
 11. global b4=.1
 12. global b5=.1
 13. global b6=.1
 14. global b7=.1
 15. global c1=.1
 16. global c2=.1
 17. global c3=.1
 18. global c4=.1
 19. global c5=.1
 20. global c6=.1
 21. global c7=.1
 22. global c8=.1
 23. exit
 24. }
 25. replace `1'=$a3*yd3+$a4*yd4+$a5*yd5+$a6*yd6+$a7*yd7/*
> */+exp($b2*yd2+$b3*yd3+$b4*yd4+$b5*yd5+$b6*yd6+$b7*yd7/*
> */+$c1*wght+$c2*wdth+$c3*hght+$c4*hp+$c5*tran+$c6*ps+$c7*ac+$c8)
 26. 
. end

. 
. nl car price
(obs = 179)

Iteration 0:   residual SS =  1.16e+10
Iteration 1:   residual SS =  1.07e+10
Iteration 2:   residual SS =  6.78e+09
Iteration 3:   residual SS =  8.75e+08
Iteration 4:   residual SS =  1.53e+08
Iteration 5:   residual SS =  8.42e+07
Iteration 6:   residual SS =  8.39e+07
Iteration 7:   residual SS =  8.39e+07
Iteration 8:   residual SS =  8.39e+07
Iteration 9:   residual SS =  8.39e+07
Iteration 10:  residual SS =  8.39e+07

      Source |       SS       df       MS            Number of obs =       179
-------------+------------------------------         F( 19,   160) =   1158.52
       Model |  1.1541e+10    19   607414473         Prob > F      =    0.0000
    Residual |    83888568   160   524303.55         R-squared     =    0.9928
-------------+------------------------------         Adj R-squared =    0.9919
       Total |  1.1625e+10   179  64942813.2         Root MSE      =  724.0881
                                                     Res. dev.     =  2845.293
(car)
------------------------------------------------------------------------------
       price |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          a3 |  -294.7452   723.3322    -0.41   0.684    -1723.255    1133.765
          a4 |  -304.9631   714.5517    -0.43   0.670    -1716.132    1106.206
          a5 |  -137.3977   700.8446    -0.20   0.845    -1521.497    1246.701
          a6 |   72.87527   695.4052     0.10   0.917    -1300.482    1446.232
          a7 |  -103.4007   742.9475    -0.14   0.889    -1570.649    1363.848
          b2 |   .0099678   .0362994     0.27   0.784      -.06172    .0816555
          b3 |   .1522578   .1022847     1.49   0.139    -.0497444      .35426
          b4 |   .1899382   .0965319     1.97   0.051    -.0007027    .3805792
          b5 |   .1540892   .0959124     1.61   0.110    -.0353283    .3435068
          b6 |    .172972   .0944704     1.83   0.069    -.0135977    .3595417
          b7 |   .2274326   .0945034     2.41   0.017     .0407977    .4140675
          c1 |  -.0007315   .1021984    -0.01   0.994    -.2025632    .2011002
          c2 |   .3681958   .1019742     3.61   0.000     .1668067    .5695849
          c3 |  -.1431584   .0519385    -2.76   0.007    -.2457317    -.040585
          c4 |   .6070451   .0665196     9.13   0.000     .4756756    .7384147
          c5 |   .1315757   .0264479     4.97   0.000     .0793437    .1838078
          c6 |   .0515819   .0218212     2.36   0.019     .0084872    .0946766
          c7 |   .1635465   .0228493     7.16   0.000     .1184213    .2086717
          c8 |    6.73024   .5719055    11.77   0.000     5.600783    7.859697
------------------------------------------------------------------------------
 (SEs, P values, CIs, and correlations are asymptotic approximations)

. 
. gen winv=1/exp(_b[b2]*yd2+_b[b3]*yd3+_b[b4]*yd4+_b[b5]*yd5+_b[b6]*yd6+_b[b7]*yd7
> /*
> */+_b[c1]*wght+_b[c2]*wdth+_b[c3]*hght+_b[c4]*hp+_b[c5]*tran+_b[c6]*ps+_b[c7]*ac
> +_b[c8])

. 
. gen nprice=price*winv

. gen nyd3=yd3*winv

. gen nyd4=yd4*winv

. gen nyd5=yd5*winv

. gen nyd6=yd6*winv

. gen nyd7=yd7*winv

. 
. program define nlncar
  1.         version 7.0
  2.         if "`1'"=="?"{
  3.                 global S_1 "a3 a4 a5 a6 a7 b2 b3 b4 b5 b6 b7 c1 c2 c3 c4 c5 c
> 6 c7 c8"
  4.                 global a3=1
  5.                 global a4=1
  6.                 global a5=1     
  7.                 global a6=1
  8.                 global a7=1
  9.                 global b2=.1    
 10.                 global b3=.1
 11.                 global b4=.1
 12.                 global b5=.1
 13.                 global b6=.1    
 14.                 global b7=.1
 15.                 global c1=.1
 16.                 global c2=.1
 17.                 global c3=.1
 18.                 global c4=.1
 19.                 global c5=.1
 20.                 global c6=.1
 21.                 global c7=.1
 22.                 global c8=.1
 23.                 exit
 24.         }
 25.         replace `1'=$a3*nyd3+$a4*nyd4+$a5*nyd5+$a6*nyd6+$a7*nyd7/*
> */+winv*exp($b2*yd2+$b3*yd3+$b4*yd4+$b5*yd5+$b6*yd6+$b7*yd7/*
> */+$c1*wght+$c2*wdth+$c3*hght+$c4*hp+$c5*tran+$c6*ps+$c7*ac+$c8)
 26. 
. end

. 
. nl ncar nprice
(obs = 179)

Iteration 0:   residual SS =  174.4452
Iteration 1:   residual SS =  166.1567
Iteration 2:   residual SS =   147.536
Iteration 3:   residual SS =  34.90292
Iteration 4:   residual SS =   32.7705
Iteration 5:   residual SS =  30.98977
Iteration 6:   residual SS =  20.55948
Iteration 7:   residual SS =  2.116144
Iteration 8:   residual SS =  1.674745
Iteration 9:   residual SS =  1.672071
Iteration 10:  residual SS =  1.672068
Iteration 11:  residual SS =  1.672068
Iteration 12:  residual SS =  1.672068
Iteration 13:  residual SS =  1.672068
Iteration 14:  residual SS =  1.672068

      Source |       SS       df       MS            Number of obs =       179
-------------+------------------------------         F( 19,   160) =    871.41
       Model |  173.025768    19  9.10661939         Prob > F      =    0.0000
    Residual |  1.67206775   160  .010450423         R-squared     =    0.9904
-------------+------------------------------         Adj R-squared =    0.9893
       Total |  174.697836   179  .975965565         Root MSE      =  .1022273
                                                     Res. dev.     = -328.5451
(ncar)
------------------------------------------------------------------------------
      nprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          a3 |   410.4256   619.1744     0.66   0.508    -812.3829    1633.234
          a4 |    378.927   650.2562     0.58   0.561     -905.265    1663.119
          a5 |   770.6115   601.2054     1.28   0.202    -416.7099    1957.933
          a6 |   624.3817   618.9925     1.01   0.315    -598.0676    1846.831
          a7 |  -122.9148   719.4492    -0.17   0.865    -1543.756    1297.927
          b2 |   .0089535   .0309918     0.29   0.773    -.0522522    .0701592
          b3 |   .0474345   .1093808     0.43   0.665    -.1685818    .2634509
          b4 |   .0938457    .108274     0.87   0.387    -.1199848    .3076761
          b5 |   .0195742   .1052628     0.19   0.853    -.1883094    .2274579
          b6 |   .0918745   .1019572     0.90   0.369     -.109481      .29323
          b7 |   .2189293   .1012639     2.16   0.032      .018943    .4189156
          c1 |   .0254744   .1207686     0.21   0.833    -.2130317    .2639805
          c2 |   .3565755   .1083292     3.29   0.001      .142636     .570515
          c3 |  -.0630705   .0554954    -1.14   0.257    -.1726685    .0465275
          c4 |   .6899452   .0852231     8.10   0.000      .521638    .8582524
          c5 |   .1428588   .0244762     5.84   0.000     .0945207    .1911968
          c6 |   .0581011   .0272835     2.13   0.035     .0042188    .1119834
          c7 |   .1473354    .033027     4.46   0.000     .0821103    .2125606
          c8 |   6.328371   .5830815    10.85   0.000     5.176842    7.479899
------------------------------------------------------------------------------
 (SEs, P values, CIs, and correlations are asymptotic approximations)

. program drop _all

. log close
      name:  <unnamed>
       log:  Z:\home\pacha\github\advanced-international-trade\first-edition\Chapt
> er-8\car_reg.log
  log type:  text
 closed on:  19 Jun 2024, 21:41:08
----------------------------------------------------------------------------------
