----------------------------------------------------------------------------------
      name:  <unnamed>
       log:  Z:\home\pacha\github\advanced-international-trade\first-edition\Chapt
> er-8\unit_quality.log
  log type:  text
 opened on:  20 Jun 2024, 03:11:27

. 
. use Z:\home\pacha\github\advanced-international-trade\first-edition\Chapter-8\tr
> uck_7990,clear

. drop if year>=86
(45 observations deleted)

. gen ve=2

. rename quan quan_t

. rename wdth wdth_t

. rename hght hght_t

. rename weight wght_t

. rename hp hp_t

. rename four four_t

. rename tran tran_t

. rename ps ps_t

. rename ac ac_t

. 
. save Z:\home\pacha\github\advanced-international-trade\first-edition\Chapter-8\t
> ruck_temp,replace
file Z:\home\pacha\github\advanced-international-trade\first-edition\Chapter-8\tru
> ck_temp.dta saved

. 
. use Z:\home\pacha\github\advanced-international-trade\first-edition\Chapter-8\ca
> r_7990,clear

. drop if year>=86
(105 observations deleted)

. gen ve=1

. rename quan quan_c

. rename wdth wdth_c

. rename hght hght_c

. rename wght wght_c

. rename hp hp_c

. rename four four_c

. rename tran tran_c

. rename ps ps_c

. rename ac ac_c

. 
. append using Z:\home\pacha\github\advanced-international-trade\first-edition\Cha
> pter-8\truck_temp

. 
. replace wdth_c=0 if wdth_c==.
(75 real changes made)

. replace hght_c=0 if hght_c==.
(75 real changes made)

. replace wght_c=0 if wght_c==.
(75 real changes made)

. replace hp_c=0 if hp_c==.
(75 real changes made)

. replace four_c=0 if four_c==.
(75 real changes made)

. replace tran_c=0 if tran_c==.
(75 real changes made)

. replace ps_c=0 if ps_c==.
(75 real changes made)

. replace ac_c=0 if ac_c==.
(75 real changes made)

. replace wdth_t=0 if wdth_t==.
(179 real changes made)

. replace hght_t=0 if hght_t==.
(179 real changes made)

. replace wght_t=0 if wght_t==.
(179 real changes made)

. replace hp_t=0 if hp_t==.
(179 real changes made)

. replace four_t=0 if four_t==.
(179 real changes made)

. replace tran_t=0 if tran_t==.
(179 real changes made)

. replace ps_t=0 if ps_t==.
(179 real changes made)

. replace ac_t=0 if ac_t==.
(179 real changes made)

. 
. tab year, gen(yd)

       year |      Freq.     Percent        Cum.
------------+-----------------------------------
         79 |         31       12.20       12.20
         80 |         34       13.39       25.59
         81 |         35       13.78       39.37
         82 |         35       13.78       53.15
         83 |         36       14.17       67.32
         84 |         40       15.75       83.07
         85 |         43       16.93      100.00
------------+-----------------------------------
      Total |        254      100.00

. 
. gen cyd2=yd2

. gen tyd2=yd2

. replace cyd2=0 if type=="JT"
(8 real changes made)

. replace tyd2=0 if type~="JT"
(26 real changes made)

. 
. gen cyd3=yd3

. gen tyd3=yd3

. replace cyd3=0 if type=="JT"
(9 real changes made)

. replace tyd3=0 if type~="JT"
(26 real changes made)

. 
. gen cyd4=yd4

. gen tyd4=yd4

. replace cyd4=0 if type=="JT"
(9 real changes made)

. replace tyd4=0 if type~="JT"
(26 real changes made)

. 
. gen cyd5=yd5

. gen tyd5=yd5

. replace cyd5=0 if type=="JT"
(7 real changes made)

. replace tyd5=0 if type~="JT"
(29 real changes made)

. 
. gen cyd6=yd6

. gen tyd6=yd6

. replace cyd6=0 if type=="JT"
(7 real changes made)

. replace tyd6=0 if type~="JT"
(33 real changes made)

. 
. gen cyd7=yd7

. gen tyd7=yd7

. replace cyd7=0 if type=="JT"
(7 real changes made)

. replace tyd7=0 if type~="JT"
(36 real changes made)

. 
. program define nlct_1
  1. version 7.0
  2. if "`1'"=="?"{
  3. global S_1 "a3 a4 a5 a6 a7 b2 b3 b4 b5 b6 b7 c1 c2 c3 c4 c5 c6 c7 c8 c9 d1 d2
>  d3 d4 d5 d6 d7 d8"
  4. global a3=1
  5. global a4=1
  6. global a5=1
  7. global a6=1
  8. global a7=1
  9. global b2=.1
 10. global b3=.1
 11. global b4=.1
 12. global b5=.1
 13. global b6=.1
 14. global b7=.1
 15. global c1=.1
 16. global c2=.1
 17. global c3=.1
 18. global c4=.1
 19. global c5=.1
 20. global c6=.1
 21. global c7=.1
 22. global c8=.1
 23. global c9=.1
 24. global d1=.1
 25. global d2=.1
 26. global d3=.1
 27. global d4=.1
 28. global d5=.1
 29. global d6=.1
 30. global d7=.1
 31. global d8=.1
 32. exit
 33. }
 34. 
. replace `1'=$a3*cyd3+$a4*cyd4+$a5*cyd5+$a6*cyd6+$a7*cyd7/*
> */+exp($b2*cyd2+$b3*cyd3+$b4*cyd4+$b5*cyd5+$b6*cyd6+$b7*cyd7/*
> */+$c1*wght_c+$c2*wdth_c+$c3*hght_c+$c4*hp_c+$c5*tran_c+$c6*ps_c+$c7*ac_c/*
> */+$c8)+exp($b2*tyd2+($b3+.16)*tyd3+($b4+.16)*tyd4+($b5+.16)*tyd5+($b6+.16)*tyd6
> +$c9*tyd7/*
> */+$d1*wght_t+$d2*wdth_t+$d3*hght_t+$d4*hp_t+$d5*tran_t+$d6*ps_t+$d7*four_t+$d8)
 35. 
. end

. 
. nl ct_1 price
(obs = 254)

Iteration 0:   residual SS =  1.51e+10
Iteration 1:   residual SS =  8.64e+09
Iteration 2:   residual SS =  6.91e+09
Iteration 3:   residual SS =  2.58e+09
Iteration 4:   residual SS =  6.90e+08
Iteration 5:   residual SS =  3.66e+08
Iteration 6:   residual SS =  1.27e+08
Iteration 7:   residual SS =  1.23e+08
Iteration 8:   residual SS =  1.02e+08
Iteration 9:   residual SS =  1.02e+08
Iteration 10:  residual SS =  1.01e+08
Iteration 11:  residual SS =  1.01e+08
Iteration 12:  residual SS =  1.01e+08
Iteration 13:  residual SS =  1.01e+08
Iteration 14:  residual SS =  1.01e+08
Iteration 15:  residual SS =  1.01e+08
Iteration 16:  residual SS =  1.01e+08
Iteration 17:  residual SS =  1.01e+08
Iteration 18:  residual SS =  1.01e+08
Iteration 19:  residual SS =  1.01e+08
Iteration 20:  residual SS =  1.01e+08
Iteration 21:  residual SS =  1.01e+08
Iteration 22:  residual SS =  1.01e+08
Iteration 23:  residual SS =  1.01e+08
Iteration 24:  residual SS =  1.01e+08
Iteration 25:  residual SS =  1.01e+08

      Source |       SS       df       MS            Number of obs =       254
-------------+------------------------------         F( 28,   226) =   1210.09
       Model |  1.5069e+10    28   538194036         Prob > F      =    0.0000
    Residual |   100515047   226  444756.844         R-squared     =    0.9934
-------------+------------------------------         Adj R-squared =    0.9926
       Total |  1.5170e+10   254  59724204.9         Root MSE      =  666.9009
                                                     Res. dev.     =  3994.496
(ct_1)
------------------------------------------------------------------------------
       price |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          a3 |   254.0918   317.1045     0.80   0.424    -370.7678    878.9513
          a4 |   505.1058   325.6388     1.55   0.122    -136.5708    1146.782
          a5 |   708.9466   317.3172     2.23   0.026       83.668    1334.225
          a6 |   1082.054   322.4415     3.36   0.001     446.6773     1717.43
          a7 |   1063.014   373.9703     2.84   0.005     326.0995    1799.929
          b2 |   .0040633   .0329008     0.12   0.902    -.0607683    .0688948
          b3 |   .0756038    .049061     1.54   0.125    -.0210716    .1722792
          b4 |   .0828575   .0490467     1.69   0.093    -.0137897    .1795048
          b5 |   .0327776    .050707     0.65   0.519    -.0671415    .1326967
          b6 |   .0351224   .0514768     0.68   0.496    -.0663135    .1365582
          b7 |   .0825554   .0557608     1.48   0.140    -.0273221    .1924329
          c1 |   .0326037   .1117298     0.29   0.771    -.1875618    .2527691
          c2 |    .385946   .1204171     3.21   0.002     .1486621    .6232299
          c3 |  -.1929238   .0568197    -3.40   0.001     -.304888   -.0809596
          c4 |    .715212   .0736084     9.72   0.000     .5701655    .8602585
          c5 |   .1578585     .03381     4.67   0.000     .0912354    .2244816
          c6 |   .0641097   .0247061     2.59   0.010     .0154259    .1127934
          c7 |   .1829447   .0242773     7.54   0.000     .1351059    .2307836
          c8 |   6.599831   .7305317     9.03   0.000     5.160306    8.039356
          c9 |   .1171992   .0634238     1.85   0.066    -.0077785    .2421769
          d1 |   .4917133   .0795807     6.18   0.000     .3348983    .6485283
          d2 |   .2622177   .1757206     1.49   0.137    -.0840426    .6084779
          d3 |  -.0451278   .0677055    -0.67   0.506    -.1785426     .088287
          d4 |   .3030767   .1701249     1.78   0.076    -.0321571    .6383106
          d5 |   .0397822   .0362731     1.10   0.274    -.0316947     .111259
          d6 |   .0967659   .0501832     1.93   0.055    -.0021208    .1956526
          d7 |   .3052359   .0715711     4.26   0.000     .1642038     .446268
          d8 |   6.299805   .9622249     6.55   0.000     4.403726    8.195885
------------------------------------------------------------------------------
 (SEs, P values, CIs, and correlations are asymptotic approximations)

. 
. gen winv=1/exp(_b[b2]*cyd2+_b[b3]*cyd3+_b[b4]*cyd4+_b[b5]*cyd5+_b[b6]*cyd6+_b[b7
> ]*cyd7/*
> */+_b[c1]*wght_c+_b[c2]*wdth_c+_b[c3]*hght_c+_b[c4]*hp_c+_b[c5]*tran_c+_b[c6]*ps
> _c/*
> */+_b[c7]*ac_c+_b[c8])

. 
. replace winv=1/exp((_b[b2]+0.16)*tyd2+(_b[b3]+.16)*tyd3+(_b[b4]+.16)*tyd4/*
> */+(_b[b5]+.16)*tyd5+(_b[b6]+.16)*tyd6+_b[c9]*tyd7/*
> */+_b[d1]*wght_t+_b[d2]*wdth_t+_b[d3]*hght_t+_b[d4]*hp_t/*
> */+_b[d5]*tran_t+_b[d6]*ps_t+_b[d7]*four_t+_b[d8]) if ve==2
(75 real changes made)

. 
. gen nprice=price*winv

. 
. 
. program define nlct_2
  1. version 7.0
  2. if "`1'"=="?"{
  3. global S_1 "a3 a4 a5 a6 a7 b2 b3 b4 b5 b6 b7 c1 c2 c3 c4 c5 c6 c7 c8 c9 d1 d2
>  d3 d4 d5 d6 d7 d8"
  4. global a3=1
  5. global a4=1
  6. global a5=1
  7. global a6=1
  8. global a7=1
  9. global b2=.1
 10. global b3=.1
 11. global b4=.1
 12. global b5=.1
 13. global b6=.1
 14. global b7=.1
 15. global c1=.1
 16. global c2=.1
 17. global c3=.1
 18. global c4=.1
 19. global c5=.1
 20. global c6=.1
 21. global c7=.1
 22. global c8=.1
 23. global c9=.1
 24. global d1=.1
 25. global d2=.1
 26. global d3=.1
 27. global d4=.1
 28. global d5=.1
 29. global d6=.1
 30. global d7=.1
 31. global d8=.1
 32. exit
 33. }
 34. replace `1'=winv*($a3*cyd3+$a4*cyd4+$a5*cyd5+$a6*cyd6+$a7*cyd7)/*
> */+winv*exp($b2*cyd2+$b3*cyd3+$b4*cyd4+$b5*cyd5+$b6*cyd6+$b7*cyd7/*
> */+$c1*wght_c+$c2*wdth_c+$c3*hght_c+$c4*hp_c+$c5*tran_c+$c6*ps_c+$c7*ac_c/*
> */+$c8)+winv*exp($b2*tyd2+($b3+.16)*tyd3+($b4+.16)*tyd4+($b5+.16)*tyd5+($b6+.16)
> *tyd6+$c9*tyd7/*
> */+$d1*wght_t+$d2*wdth_t+$d3*hght_t+$d4*hp_t+$d5*tran_t+$d6*ps_t+$d7*four_t+$d8)
 35. 
. end

. 
. nl ct_2 nprice
(obs = 254)

Iteration 0:   residual SS =  353.5865
Iteration 1:   residual SS =   334.435
Iteration 2:   residual SS =  289.3018
Iteration 3:   residual SS =  133.5526
Iteration 4:   residual SS =   99.2393
Iteration 5:   residual SS =   13.6599
Iteration 6:   residual SS =  6.893439
Iteration 7:   residual SS =  5.473819
Iteration 8:   residual SS =  2.966103
Iteration 9:   residual SS =  2.957318
Iteration 10:  residual SS =  2.957298
Iteration 11:  residual SS =  2.957296
Iteration 12:  residual SS =  2.957296
Iteration 13:  residual SS =  2.957296
Iteration 14:  residual SS =  2.957295
Iteration 15:  residual SS =  2.957295
Iteration 16:  residual SS =  2.957295
Iteration 17:  residual SS =  2.957295
Iteration 18:  residual SS =  2.957295
Iteration 19:  residual SS =  2.957295
Iteration 20:  residual SS =  2.957295
Iteration 21:  residual SS =  2.957295

      Source |       SS       df       MS            Number of obs =       254
-------------+------------------------------         F( 28,   226) =    958.75
       Model |  351.277591    28  12.5456282         Prob > F      =    0.0000
    Residual |  2.95729549   226  .013085378         R-squared     =    0.9917
-------------+------------------------------         Adj R-squared =    0.9906
       Total |  354.234886   254  1.39462554         Root MSE      =  .1143913
                                                     Res. dev.     = -410.2562
(ct_2)
------------------------------------------------------------------------------
      nprice |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          a3 |   367.9829    239.059     1.54   0.125    -103.0867    839.0525
          a4 |    600.553   254.2261     2.36   0.019     99.59628     1101.51
          a5 |   887.9399   243.5428     3.65   0.000     408.0348    1367.845
          a6 |   1104.433   251.0245     4.40   0.000     609.7847     1599.08
          a7 |   855.7993   366.2444     2.34   0.020     134.1088     1577.49
          b2 |   .0130387   .0303131     0.43   0.668    -.0466937    .0727711
          b3 |   .0674477   .0425176     1.59   0.114     -.016334    .1512294
          b4 |   .0701234   .0441821     1.59   0.114    -.0169382     .157185
          b5 |  -.0005627   .0470779    -0.01   0.990    -.0933305    .0922051
          b6 |   .0179989   .0473905     0.38   0.704    -.0753848    .1113826
          b7 |   .1007712   .0641587     1.57   0.118    -.0256545    .2271969
          c1 |   .0492474   .1311096     0.38   0.708    -.2091061     .307601
          c2 |   .3908689   .1383663     2.82   0.005     .1182159     .663522
          c3 |  -.0618204   .0611492    -1.01   0.313    -.1823158     .058675
          c4 |   .8103277   .1038045     7.81   0.000     .6057792    1.014876
          c5 |   .1779391   .0355273     5.01   0.000     .1079319    .2479463
          c6 |   .0693687   .0304968     2.27   0.024     .0092743     .129463
          c7 |   .1567051   .0360384     4.35   0.000     .0856908    .2277193
          c8 |   5.839036   .8621144     6.77   0.000     4.140226    7.537847
          c9 |   .1059852   .0550545     1.93   0.055    -.0025007    .2144711
          d1 |   .4759918   .1172145     4.06   0.000     .2450187    .7069649
          d2 |   .2120021   .1419991     1.49   0.137    -.0678094    .4918136
          d3 |  -.0270369    .074052    -0.37   0.715    -.1729575    .1188837
          d4 |     .24435   .1516866     1.61   0.109    -.0545508    .5432508
          d5 |   .0530065   .0356148     1.49   0.138     -.017173     .123186
          d6 |   .0575178   .0639555     0.90   0.369    -.0685076    .1835431
          d7 |   .2971909   .0566882     5.24   0.000      .185486    .4088959
          d8 |   6.630805   .7652819     8.66   0.000     5.122804    8.138805
------------------------------------------------------------------------------
 (SEs, P values, CIs, and correlations are asymptotic approximations)

. 
. 
. preserve

. keep if ve==1
(75 observations deleted)

. 
. gen quality=exp(_b[c8]+_b[b2]+_b[c1]*wght_c+_b[c2]*wdth_c+_b[c3]*hght_c+_b[c4]*h
> p_c/*
> */+_b[c5]*tran_c+_b[c6]*ps_c+_b[c7]*ac_c)

. 
. save Z:\home\pacha\github\advanced-international-trade\first-edition\Chapter-8\q
> uality_c,replace
file Z:\home\pacha\github\advanced-international-trade\first-edition\Chapter-8\qua
> lity_c.dta saved

. 
. gen nvalue=quality*quan_c

. egen aquan=mean(quan_c), by(year)

. egen anvalue=mean(nvalue),by(year)

. gen uquality=anvalue/aquan

. collapse (mean)uquality, by(year)

. list

     +-----------------+
     | year   uquality |
     |-----------------|
  1. |   79   4360.772 |
  2. |   80   4472.789 |
  3. |   81   4867.316 |
  4. |   82   5252.845 |
  5. |   83   5636.667 |
     |-----------------|
  6. |   84    5862.13 |
  7. |   85   6130.052 |
     +-----------------+

. restore

. 
. preserve

. keep if ve==2
(179 observations deleted)

. 
. gen quality=exp(_b[d8]+_b[b2]+_b[d1]*wght_t+_b[d2]*wdth_t+_b[d3]*hght_t+_b[d4]*h
> p_t/*
> */+_b[d5]*tran_t+_b[d6]*ps_t+_b[d7]*four_t)

. 
. save Z:\home\pacha\github\advanced-international-trade\first-edition\Chapter-8\q
> uality_t,replace
file Z:\home\pacha\github\advanced-international-trade\first-edition\Chapter-8\qua
> lity_t.dta saved

. 
. gen nvalue=quality*quan_t

. egen aquan=mean(quan_t),by(year)

. egen anvalue=mean(nvalue), by(year)

. gen uquality=anvalue/aquan

. collapse (mean)uquality, by(year)

. list

     +-----------------+
     | year   uquality |
     |-----------------|
  1. |   79   4626.836 |
  2. |   80   4637.583 |
  3. |   81   4791.255 |
  4. |   82   4929.792 |
  5. |   83   4997.103 |
     |-----------------|
  6. |   84   5009.971 |
  7. |   85   5432.772 |
     +-----------------+

. restore

. 
. program drop _all

. log close
      name:  <unnamed>
       log:  Z:\home\pacha\github\advanced-international-trade\first-edition\Chapt
> er-8\unit_quality.log
  log type:  text
 closed on:  20 Jun 2024, 03:11:31
----------------------------------------------------------------------------------
